---
kind: method
id: M:Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray3d.GetValueAsDoubles
source: html/4089ceaa-fa2a-675e-6bd8-f85bf9b754b3.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyDoubleArray3d.GetValueAsDoubles Method

Get the value property as doubles.

## Syntax (C#)
```csharp
public IList<double> GetValueAsDoubles()
```